{
  "generated": "2026-02-11T23:08:56.272666",
  "project": "FlipSide — the dark side of small print",
  "git": {
    "total_commits": 7,
    "recent": [
      {
        "hash": "87612965",
        "date": "2026-02-11T20:14:34+01:00",
        "message": "Add complete FlipSide product: backend, frontend, monitoring, and full hackathon log"
      },
      {
        "hash": "d362b70c",
        "date": "2026-02-11T00:08:08+01:00",
        "message": "Expand README with full FlipSide product description"
      },
      {
        "hash": "4523c580",
        "date": "2026-02-11T00:04:43+01:00",
        "message": "Rewrite builder profile with real credentials"
      },
      {
        "hash": "1f1adca3",
        "date": "2026-02-10T23:59:18+01:00",
        "message": "Add README, remove 731-corpus references, clean for public"
      },
      {
        "hash": "253f2089",
        "date": "2026-02-10T23:56:26+01:00",
        "message": "Add FlipSide product concept document"
      },
      {
        "hash": "547d0fc2",
        "date": "2026-02-10T23:55:14+01:00",
        "message": "Restructure for public repo: clean log, translate profile"
      },
      {
        "hash": "9a481953",
        "date": "2026-02-10T23:49:23+01:00",
        "message": "Initial commit: FlipSide methodology and decision process"
      }
    ],
    "uncommitted_changes": "app.py                  |  171 +-\n decision_monitor.py     |    8 +-\n hackathon_log_update.md |  124 +-\n hackaton.md             |    2 +-\n strategy.md             |   82 +\n templates/index.html    | 4527 +++++++++++++++--------------------------------\n 6 files changed, 1720 insertions(+), 3194 deletions(-)"
  },
  "strategies": [
    {
      "title": "Decision: Let 4.6 Study Problems Via Screenshots",
      "date": "2025-02-11",
      "insight": "The model's debugging quality scales with how much you make it work for the answer. Giving it the answer short-circuits the deep tracing that produces robust fixes.",
      "attempts": 3,
      "full_text": "Decision: Let 4.6 Study Problems Via Screenshots\n\n**Date**: 2025-02-11\n**Context**: During the hackathon, a UI flicker bug appeared in the clause card buttons (MD, star, copy). Rather than describing the problem or suggesting a cause, the approach was to show Claude 4.6 the screenshot and ask it to analyze.\n\n**The strategy**: Present the visual evidence. Don't coach. Don't offer hypotheses. Let the model study the problem independently and trace the root cause.\n\n**What happened**:\n\n1. First atte"
    },
    {
      "title": "Decision: Let 4.6 Watch Itself Via Playwright",
      "date": "2025-02-11",
      "insight": "Making the model both the author and the observer of diagnostic tooling creates a closed feedback loop. The model knows what to look for because it wrote the system, and it knows what the data means because it wrote the monitor.",
      "attempts": 4,
      "full_text": "Decision: Let 4.6 Watch Itself Via Playwright\n\n**Date**: 2025-02-11\n**Context**: After three code-level fix attempts, the flicker persisted. The in-page debug monitor (MutationObserver injected into the app) showed zero mutations — it was disconnecting during the render cycle, missing all mutations. The user's instinct: \"I'd rather have you watch yourself.\"\n\n**The strategy**: Instead of describing what might be wrong or asking the model to guess from code, give it automated tooling to observe it"
    },
    {
      "title": "Prompt: Parallel Tasks & Speed Improvements Probe",
      "date": "2026-02-11",
      "insight": "",
      "attempts": 0,
      "full_text": "Prompt: Parallel Tasks & Speed Improvements Probe\n\n**Date**: 2026-02-11\n**Context**: FlipSide's analysis pipeline runs quick scan + deep analysis in parallel, but the frontend render cycle (300ms) does heavy synchronous work. This prompt forces a full-path audit from upload to rendered card.\n\n**The prompt**:\n\n> Identify every opportunity to reduce wall-clock time in FlipSide's analysis pipeline. Trace the full path from file upload to final rendered card — backend (app.py) and frontend (template"
    },
    {
      "title": "Decision: Use Meta-Prompting to Assess Before Building",
      "date": "2026-02-11",
      "insight": "The builder's instinct when they can't visualize something is to start coding. The better instinct is to write a prompt that forces the visualization to become explicit — then execute it, cross-reference it, and only build what survives scrutiny.",
      "attempts": 5,
      "full_text": "Decision: Use Meta-Prompting to Assess Before Building\n\n**Date**: 2026-02-11\n**Context**: The human had a concept for a 3D card-flip animation showing two thinking processes (reader's naive impression → drafter's strategic intent). The concept was clear emotionally (\"I physically want to see something flip\") but unclear technically — the visualization, streaming integration, and prompt architecture were tangled together. The instinct was to start coding.\n\n**The strategy**: Instead of building th"
    },
    {
      "title": "Decision: Write the Prompt, Not the Code",
      "date": "2026-02-11",
      "insight": "When incremental patches keep failing, the problem isn't the patches — it's the architecture. Writing a prompt instead of more code forces you to design the architecture explicitly. The prompt becomes both the specification and the documentation.",
      "attempts": 4,
      "full_text": "Decision: Write the Prompt, Not the Code\n\n**Date**: 2026-02-11\n**Context**: The 3D flip card feature had been through three debugging sessions. Each session found and fixed real bugs (markdown token collision, event listener loss, state destruction), but the flip still didn't work — the card grew and shrank repeatedly, clicks didn't register, and progressive disclosure failed. The human recognized the pattern: incremental patching of a broken architecture.\n\n**The strategy**: Instead of a fourth "
    }
  ],
  "prompt_progress": {
    "total": 51,
    "done": 48,
    "skipped": 3,
    "categories": {
      "Animation": 5,
      "UX": 14,
      "Navigation": 6,
      "Sorting": 1,
      "Interactivity": 4,
      "Filtering": 2,
      "Highlighting": 2,
      "Action": 2,
      "Visualization": 6,
      "Theme": 1,
      "Accessibility": 1,
      "Export": 4,
      "Mobile": 1,
      "Feature": 1,
      "Fun": 1
    }
  },
  "frontend": {
    "event_listeners": 28,
    "css_animations": 5,
    "state_variables": 28,
    "dom_functions": 38,
    "total_lines": 2428
  },
  "failures": [
    {
      "pattern": "Anchoring Bias",
      "description": "The human had flagged an existing competitor that already solved the same problem. Despite this, Claude scored the initial winner's uniqueness at 10/10 across three subsequent documents. The competito"
    },
    {
      "pattern": "Framing Bias",
      "description": "The human asked about a document comparison feature. Claude narrowed it to \"compare two insurance policies\" because it was anchored on ContractLens. The human's actual intent was broader: any two docu"
    },
    {
      "pattern": "Build Phase Documentation Gap",
      "description": "We ran our own analysis prompt against this hackathon log. It found three failure modes:\n1. The frontend (4,008 lines) had zero log entries — no documented examination against the project's own princi"
    },
    {
      "pattern": "Prompting About Prompting Has the Same Bias",
      "description": "Asked Claude to write a prompt analyzing our vibecoding process. The prompt contained adjective bias (\"experienced practitioners,\" \"what this builder does differently\"), unverified claims (\"most vibec"
    }
  ]
}